app/controllers/carts_controller.rb

INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2020-07-13 20:33:13.167798"], ["updated_at", "2020-07-13 20:33:13.167798"]]
---
  def create
    @cart = Cart.new(cart_params)

    respond_to do |format|
      if @cart.save

SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
---
    def set_cart
      @cart = Cart.find(params[:id])