app/controllers/products_controller.rb

UPDATE "products" SET "title" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["title", "The Great Book 127"], ["updated_at", "2020-07-13 20:33:12.860685"], ["id", 980190962]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
---
    def set_product
      @product = Product.find(params[:id])